noarkexchange/src/test/resources/p360/PutMessageAppReceiptFeilmelding.xml

<s:Envelope encoding="utf-8" xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
    <s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
        <PutMessageRequest xmlns="http://www.arkivverket.no/Noark/Exchange/types">
            <envelope contentNamespace="http://www.arkivverket.no/Noark4-1-WS-WD/types"
                      conversationId="19c73be0-f4fa-4c86-bc84-a2dfd912f948" xmlns="">
                <sender>
                    <orgnr>543452342</orgnr>
                </sender>
                <receiver>
                    <orgnr>553322112</orgnr>
                </receiver>
            </envelope>
            <payload xsi:type="xsd:string" xmlns="">&lt;AppReceipt type="ERROR"
                xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                xmlns="http://www.arkivverket.no/Noark/Exchange/types"&gt;
                &lt;message code="-1" xmlns=""&gt;
                &lt;text&gt;CallMethod route://SI.Biz.Core, Version=4.0.0.0, Culture=neutral,
                PublicKeyToken=84474dc3c65e4430//SI.Biz.Core.Surface.MetaExecutionManager/ExecuteSingleAction failed.
                System.Transactions.TransactionException: The partner transaction manager has disabled its support for
                remote/network transactions. (Exception from HRESULT: 0x8004D025) ---&amp;gt;
                System.Runtime.InteropServices.COMException: The partner transaction manager has disabled its support
                for remote/network transactions. (Exception from HRESULT: 0x8004D025)
                at System.Transactions.Oletx.IDtcProxyShimFactory.ReceiveTransaction(UInt32 propgationTokenSize, Byte[]
                propgationToken, IntPtr managedIdentifier, Guid&amp;amp; transactionIdentifier,
                OletxTransactionIsolationLevel&amp;amp; isolationLevel, ITransactionShim&amp;amp; transactionShim)
                at System.Transactions.TransactionInterop.GetOletxTransactionFromTransmitterPropigationToken(Byte[]
                propagationToken)
                --- End of inner exception stack trace ---
                at System.Transactions.Oletx.OletxTransactionManager.ProxyException(COMException comException)
                at System.Transactions.TransactionInterop.GetOletxTransactionFromTransmitterPropigationToken(Byte[]
                propagationToken)
                at System.Transactions.TransactionStatePSPEOperation.PSPEPromote(InternalTransaction tx)
                at System.Transactions.TransactionStateDelegatedBase.EnterState(InternalTransaction tx)
                at System.Transactions.EnlistableStates.Promote(InternalTransaction tx)
                at System.Transactions.Transaction.Promote()
                at System.Transactions.TransactionInterop.ConvertToOletxTransaction(Transaction transaction)
                at System.Transactions.TransactionInterop.GetExportCookie(Transaction transaction, Byte[] whereabouts)
                at System.Data.SqlClient.SqlInternalConnection.GetTransactionCookie(Transaction transaction, Byte[]
                whereAbouts)
                at System.Data.SqlClient.SqlInternalConnection.EnlistNonNull(Transaction tx)
                at System.Data.SqlClient.SqlInternalConnection.Enlist(Transaction tx)
                at System.Data.ProviderBase.DbConnectionInternal.ActivateConnection(Transaction transaction)
                at System.Data.ProviderBase.DbConnectionPool.PrepareConnection(DbConnection owningObject,
                DbConnectionInternal obj, Transaction transaction)
                at System.Data.ProviderBase.DbConnectionPool.TryGetConnection(DbConnection owningObject, UInt32
                waitForMultipleObjectsTimeout, Boolean allowCreate, Boolean onlyOneCheckConnection, DbConnectionOptions
                userOptions, DbConnectionInternal&amp;amp; connection)
                at System.Data.ProviderBase.DbConnectionPool.TryGetConnection(DbConnection owningObject,
                TaskCompletionSource`1 retry, DbConnectionOptions userOptions, DbConnectionInternal&amp;amp; connection)
                at System.Data.ProviderBase.DbConnectionFactory.TryGetConnection(DbConnection owningConnection,
                TaskCompletionSource`1 retry, DbConnectionOptions userOptions, DbConnectionInternal oldConnection,
                DbConnectionInternal&amp;amp; connection)
                at System.Data.ProviderBase.DbConnectionInternal.TryOpenConnectionInternal(DbConnection outerConnection,
                DbConnectionFactory connectionFactory, TaskCompletionSource`1 retry, DbConnectionOptions userOptions)
                at System.Data.SqlClient.SqlConnection.TryOpenInner(TaskCompletionSource`1 retry)
                at System.Data.SqlClient.SqlConnection.TryOpen(TaskCompletionSource`1 retry)
                at System.Data.SqlClient.SqlConnection.Open()
                at SI.Data.MetaX.MetaXConnection.Open()
                at SI.Biz.Core.InstanceData.EntityRelationInfo.AddMetaInfoByNamespace(String namespaceName)
                at SI.Biz.Core.InstanceData.EntityRelationInfo.BuildEntityRelations()
                at SI.Biz.Core.InstanceData.EntityRelationInfo.Load()
                at SI.Biz.Core.Instance.get_EntityRelationInfo()
                at SI.Biz.Core.Security.SecurityRowPermissions.XMLActionIsAllowed(XmlElement actionXml)
                at SI.Biz.Core.MetaExecution.AccessControl.ValidateXmlActionAllowed(IEnumerable`1 statements)
                at SI.Biz.Core.MetaExecution.AccessControl.Validate(IEnumerable`1 statements)
                at SI.Biz.Core.MetaExecution.MetaOperationManager.RunOperations(Boolean skipValidation, Boolean
                skipAccessControl)
                at SI.Biz.Core.MetaActionOperation.ExecuteSingleAction(String xmlOpr)
                at (Object , Object[] )
                at SI.Util.Reflection.ObjectFactory.InvokePublicVisibleOnly(String typeName, String methodName, Object[]
                args)
                at SI.Biz.Core.Dispatch.DispatchImpl.InternalInvokeExecute(InvokeSite inv)&lt;/text&gt;
                &lt;/message&gt;
                &lt;/AppReceipt&gt;</payload>
        </PutMessageRequest>
    </s:Body>
</s:Envelope>